In [2]:
# 数据清洗包含了缺失值、重复值、字符串操作等等内容 是数据预处理中重要的一部分
import pandas as pd
import numpy as np
from numpy import nan as NULL
from numpy import nan as NA
from pandas import DataFrame, Series

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [10]:
string_data.notna()

0    False
1     True
2    False
3     True
dtype: bool

In [11]:
string_data.fillna?

In [12]:
df = DataFrame([1,2]).reindex?

Object `reindex` not found.

In [ ]:
df = DataFrame([1,2]).reindex

In [13]:
df = DataFrame(np.arange(10))

In [14]:
df.reindex?

In [15]:
string_data.fillna(method='ffill')

0         None
1    artichoke
2    artichoke
3      avocado
dtype: object

In [16]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [17]:
data.dropna() # remove缺失值

0    1.0
2    3.5
4    7.0
dtype: float64

In [18]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                   [NA, NA, NA], [NA, 6.5, 3.]], columns=list('abc'))

In [19]:
data

     a    b    c
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
cleaned = data.dropna(how='all') # 当所有值都是NA才删除

In [21]:
cleaned

     a    b    c
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data['a'][1] = NA

In [23]:
data.dropna?

In [24]:
data[4] = NA

In [25]:
data

     a    b    c   4
0  1.0  6.5  3.0 NaN
1  NaN  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [26]:
data.dropna(axis=1, how='all')

     a    b    c
0  1.0  6.5  3.0
1  NaN  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
data.drop?

In [28]:
data.drop(0)

    a    b    c   4
1 NaN  NaN  NaN NaN
2 NaN  NaN  NaN NaN
3 NaN  6.5  3.0 NaN

In [29]:
df = pd.DataFrame(np.random.randn(7, 3))

In [30]:
df.iloc[:4, 1] = NA

In [31]:
df.iloc[:2, 2] = NA

In [32]:
df

          0         1         2
0  0.727225       NaN       NaN
1  0.496073       NaN       NaN
2 -1.586515       NaN  0.809692
3 -0.226916       NaN  1.214560
4 -0.832148 -0.416649 -0.495800
5 -0.428583  1.449043  0.538643
6 -1.934541  0.331900 -0.253213

In [33]:
df.dropna()

          0         1         2
4 -0.832148 -0.416649 -0.495800
5 -0.428583  1.449043  0.538643
6 -1.934541  0.331900 -0.253213

In [34]:
df.dropna(axis=1)

          0
0  0.727225
1  0.496073
2 -1.586515
3 -0.226916
4 -0.832148
5 -0.428583
6 -1.934541

In [35]:
df.dropna(thresh=2, inplace=False)

          0         1         2
2 -1.586515       NaN  0.809692
3 -0.226916       NaN  1.214560
4 -0.832148 -0.416649 -0.495800
5 -0.428583  1.449043  0.538643
6 -1.934541  0.331900 -0.253213

In [36]:
df

          0         1         2
0  0.727225       NaN       NaN
1  0.496073       NaN       NaN
2 -1.586515       NaN  0.809692
3 -0.226916       NaN  1.214560
4 -0.832148 -0.416649 -0.495800
5 -0.428583  1.449043  0.538643
6 -1.934541  0.331900 -0.253213

In [37]:
df

          0         1         2
0  0.727225       NaN       NaN
1  0.496073       NaN       NaN
2 -1.586515       NaN  0.809692
3 -0.226916       NaN  1.214560
4 -0.832148 -0.416649 -0.495800
5 -0.428583  1.449043  0.538643
6 -1.934541  0.331900 -0.253213

In [38]:
df.fillna({1: 0.5, 2: 0}) # 使用字典分别指定不同列的处理方法

          0         1         2
0  0.727225  0.500000  0.000000
1  0.496073  0.500000  0.000000
2 -1.586515  0.500000  0.809692
3 -0.226916  0.500000  1.214560
4 -0.832148 -0.416649 -0.495800
5 -0.428583  1.449043  0.538643
6 -1.934541  0.331900 -0.253213

In [39]:
df.fillna(limit=2, method='bfill', inplace=True)

In [40]:
df.fillna(limit=2, method='ffill', inplace=True)

In [41]:
df

          0         1         2
0  0.727225       NaN  0.809692
1  0.496073       NaN  0.809692
2 -1.586515 -0.416649  0.809692
3 -0.226916 -0.416649  1.214560
4 -0.832148 -0.416649 -0.495800
5 -0.428583  1.449043  0.538643
6 -1.934541  0.331900 -0.253213

In [42]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [43]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [44]:
data.fillna(data.mean()) # 使用平均值进行填充

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [45]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [46]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

In [47]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [48]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [49]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [50]:
data['k3'] = range(7)

In [51]:
data

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [52]:
data.drop_duplicates(['k1', 'k2'], keep=False)

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4

In [53]:
data['k1'].str.title() # 创建字符串 然后使用字符串的内置函数对其进行操作

0    One
1    Two
2    One
3    Two
4    One
5    Two
6    Two
Name: k1, dtype: object

In [54]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [55]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [56]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [57]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [58]:
lowercased = data['food'].str.lower()

In [59]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [60]:
data['animal'] = lowercased.map(meat_to_animal) # 使用map方法 获取键值对的映射

In [61]:
data.drop('animal', axis=1)

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [62]:
data['animal'] = lowercased.map(lambda x: meat_to_animal[x.lower()]) # 定义lambda函数 处理键值对的映射

In [63]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [64]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [65]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [66]:
data.replace(-999, NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [67]:
data.replace([1000, -999], NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [68]:
data.replace([-1000, -999], [0, NA])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [69]:
data.replace({-1000: 0, -999: NA})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [70]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [71]:
data.replace?

In [72]:
data.replace(None, method='ffill')

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [73]:
str1 = 'hello world'
str1.replace('hel', 'fuck')

'fucklo world'

In [74]:
str1

'hello world'

In [75]:
str.replace?

In [76]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [77]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [78]:
transform = lambda x: x[:4].upper()

In [79]:
transform

In [80]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [81]:
data.index = data.index.map(transform)

In [82]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [83]:
data.index = data.index.str.title()

In [84]:
data

      one  two  three  four
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [85]:
data.columns

Index(['one', 'two', 'three', 'four'], dtype='object')

In [86]:
data.columns = data.columns.str.upper()

In [87]:
data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [88]:
data.rename?

In [89]:
# data.rename(index=str.title, columns=str.upper) # ?
data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [90]:
data.rename(index={'Ohio': "INDIANA"},
           columns={'THREEE': 'peekaboo'}, inplace=True)

In [91]:
data

         ONE  TWO  THREE  FOUR
INDIANA    0    1      2     3
Colo       4    5      6     7
New        8    9     10    11

In [92]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [93]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [94]:
bins = [18, 25, 35, 60, 100]

In [95]:
cats = pd.cut(ages, bins, right=True)

In [96]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [97]:
cats.codes # 获取值所属的箱位

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [98]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [99]:
pd.value_counts(cats) # 箱也可以算作是一种数据值

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [100]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [101]:
pd.cut(ages, bins, right=True, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [102]:
data = np.random.randn(20)

In [103]:
pd.cut(data, 4, precision=2)

[(-0.24, 0.59], (0.59, 1.42], (-0.24, 0.59], (-1.9, -1.07], (-0.24, 0.59], ..., (-1.07, -0.24], (-0.24, 0.59], (0.59, 1.42], (-1.07, -0.24], (-1.07, -0.24]]
Length: 20
Categories (4, interval[float64, right]): [(-1.9, -1.07] < (-1.07, -0.24] < (-0.24, 0.59] < (0.59, 1.42]]

In [104]:
data = np.random.randn(1000) # 正态分布

In [105]:
data

array([ 8.28890430e-02, -3.11980723e-01,  6.52038980e-01,  3.27540172e-01,
        6.22801635e-01, -4.59826110e-01,  6.30370139e-01,  4.97524637e-01,
        1.57123825e+00, -8.51726788e-02, -2.86554472e-01, -8.60400276e-02,
       -1.92654921e-01,  6.65039524e-01,  2.86645438e-01,  1.29877878e+00,
       -1.18754350e+00,  4.27347247e-01, -6.27760868e-01,  1.06212582e+00,
       -6.08162988e-01,  5.86627641e-01, -8.00059066e-02, -5.42740341e-02,
        2.07136610e-01, -9.54810201e-01, -5.01747534e-01,  5.77396376e-01,
        7.82664717e-01, -3.04528384e-01,  1.30028407e+00, -4.13133697e-01,
        5.15342443e-01,  1.78477402e+00, -6.84189677e-01,  4.83548985e-01,
       -1.09514614e-01, -7.63092306e-01, -8.97839105e-01, -1.14168726e+00,
        7.57656126e-01, -1.80005178e+00,  1.47035510e-01, -6.63472615e-01,
       -1.92227358e+00, -7.27827949e-01, -1.00769733e+00, -1.05924973e+00,
       -1.17308708e+00, -1.84394431e-01,  1.85241045e-03, -1.12042582e+00,
       -3.77420898e-01,  1.06864808e+00, -2.07867087e+00, -1.09609033e-01,
        1.32250871e+00,  1.30358760e+00, -6.94414594e-02, -7.95662875e-01,
       -3.38919641e-01, -1.68107769e+00, -1.94070487e+00, -1.97000430e-02,
       -4.61891635e-01,  1.67164286e+00,  2.63944574e+00, -6.99519212e-01,
        8.86420262e-01, -3.10087187e-01,  9.72012799e-01,  1.56405893e+00,
       -1.75722951e-01,  1.55947843e+00, -1.27794491e-01, -7.22269547e-01,
       -9.60853994e-01, -1.13355692e+00, -1.06299867e+00, -1.09604226e+00,
       -3.19369669e-01, -2.01010733e+00, -6.24108390e-01, -1.24536586e+00,
       -9.54269275e-01,  1.24132338e+00,  8.24477914e-01,  8.18126968e-01,
        9.77046700e-01,  2.63054739e-01,  1.23755311e+00, -6.03756953e-02,
        7.51764619e-01,  5.84991973e-01,  8.41600955e-02,  3.39622249e-01,
       -9.54247602e-01, -3.20988249e-01, -1.17730453e+00,  1.76121589e+00,
       -1.32579516e+00,  8.52940184e-01,  1.92643304e+00,  3.53365490e-01,
        2.04388563e+00,  6.92338524e-01,  1.95295274e+00,  2.60376173e+00,
        1.22995536e-01,  8.55162708e-02,  1.44404164e+00, -4.71414810e-01,
        6.75308673e-01,  1.70325476e+00, -3.54763955e-01, -1.70408499e+00,
        1.84796224e-01,  1.42642845e+00,  1.33230351e+00,  3.94943903e-01,
       -1.42318653e+00, -1.45348222e-01,  3.12528456e-01, -2.20799226e-01,
        6.78434484e-01,  9.19905987e-01,  1.27686382e+00,  1.36134001e+00,
       -7.88061347e-01, -3.76846432e-01,  1.93256508e-01, -2.89390728e-01,
       -7.79282543e-02,  1.41095942e+00,  5.77940089e-01,  3.68408870e-01,
        2.34030823e-01,  5.74841253e-01,  1.53050404e+00,  1.16609670e+00,
       -3.04256507e-01,  2.96598767e-01, -2.07475405e+00,  8.32848290e-01,
        8.80067035e-01, -6.72920270e-01, -3.38054941e-02,  5.46985675e-01,
       -1.91132802e+00,  1.68010910e+00, -1.06252774e+00,  8.57146940e-01,
       -3.21673172e-01, -5.53836630e-01,  3.66682745e+00, -6.17213266e-01,
       -1.34896737e+00,  1.52541418e-01, -1.58715732e-02, -1.14438280e-01,
       -4.33970004e-01,  4.39178577e-01,  8.92013463e-02,  7.06531204e-01,
        2.45036072e-01,  9.37830434e-02, -1.48210708e-01,  3.02024628e-01,
       -2.01303766e+00, -1.96098152e+00, -6.14281600e-02, -3.10143625e-01,
        8.00838392e-01,  6.96222819e-01,  1.09623445e-01,  1.11229928e+00,
        5.18463049e-02,  5.75124519e-01, -1.82865552e-01, -4.30451755e-01,
       -9.18945258e-02,  1.38416508e-01,  1.37209426e+00, -4.86729667e-02,
        2.71259904e-01, -4.41426354e-01,  4.81071558e-01, -8.64068856e-01,
        9.55877462e-01,  1.43342868e+00,  6.45160298e-01, -1.19616593e+00,
       -7.93653885e-01,  2.47262950e-01,  6.34623808e-01, -7.02202228e-01,
       -1.28453929e-01, -1.57389889e+00,  2.97857269e-01,  1.40737775e+00,
       -8.55015997e-01,  1.19875827e-01, -1.09579803e-01,  1.50732925e+00,
        3.91045157e-01, -3.41124668e-02, -8.31715470e-01,  4.71807843e-01,
       -2.04274647e+00, -8.41778238e-02, -1.48622390e-01, -4.42596183e-01,
        1.94845887e-01, -1.86964847e+00,  9.08870745e-01, -2.74227071e+00,
       -2.04577290e+00,  1.44217027e+00, -1.16649594e-01, -8.07572547e-01,
        6.78520529e-01,  7.59512836e-01, -3.48692216e-01,  8.80677636e-01,
       -3.99951897e-01,  3.79484810e-01, -4.06772260e-01,  2.25453852e-01,
       -3.99316528e-01, -1.68265723e+00,  6.09721671e-01,  2.44086603e-01,
        3.08424707e-01, -1.13011436e+00, -7.88860908e-01, -1.23865225e+00,
        1.13410065e+00,  1.47847823e+00, -2.18212770e+00,  1.37938263e+00,
       -3.29748328e-03,  8.38193452e-02,  8.72911841e-01, -4.30015348e-01,
        2.50256752e+00,  1.59282617e-01,  1.26443433e+00,  8.51113504e-01,
        1.36322276e+00,  8.57283618e-01,  5.41994483e-01,  3.33901991e-01,
        1.46803882e+00, -6.89064661e-02,  1.97359020e-02, -4.27333761e-01,
       -5.60928758e-01,  9.65335897e-01, -1.68847398e-01,  1.24029775e+00,
        9.87981595e-01, -4.88441577e-01, -1.65908115e+00,  9.24432282e-02,
        9.43793767e-01,  1.19019161e-01,  1.32785382e+00,  5.65672527e-01,
        1.65006036e-01,  1.45584804e-01, -1.36983924e+00,  8.53307542e-01,
       -7.65757856e-01, -9.63904488e-02, -1.05058721e+00,  2.96668530e-01,
       -2.07541427e-01,  1.48166294e+00, -5.95740202e-01,  1.07130632e+00,
        8.19678091e-01,  9.11096265e-01,  9.14472878e-01,  9.74186178e-01,
        1.37193623e+00, -5.05982171e-01, -3.18230023e-01,  1.57409272e+00,
        1.50779383e+00, -1.76760129e+00, -2.08485713e-01, -7.73779072e-01,
        1.32374756e-01,  5.40931436e-01,  5.89175569e-01,  3.87145773e-01,
        6.97763730e-01, -1.79184228e-01,  1.56075755e+00, -6.55394047e-01,
       -1.25897552e+00,  1.53929320e+00, -8.95930061e-01,  1.31704693e+00,
        2.85539719e-01,  1.14338930e+00, -8.42438717e-01, -7.77164757e-01,
       -1.28700017e-01, -1.03826364e+00, -1.29094457e+00,  7.03958020e-01,
       -1.53670462e+00, -1.98166505e+00, -6.47843496e-01,  3.34221565e-01,
       -3.94618502e-01,  6.03917637e-02,  1.11084803e+00,  1.17754038e-01,
       -1.27229462e-01,  3.90558128e-01, -3.57125015e-02,  7.78973082e-01,
       -1.99086813e-01, -3.85319019e-01, -1.97846331e-02, -7.15988211e-01,
       -5.46508782e-02,  8.51791332e-01, -2.43231532e+00,  1.86737819e+00,
        3.04389737e-01,  1.49757566e-01,  4.86527290e-01, -1.43044186e-01,
       -1.76365306e+00,  6.12783945e-01,  1.17552708e+00, -4.25591735e-01,
       -2.38603197e-01, -2.48448830e-01,  6.78991918e-01, -4.42256730e-01,
        9.66078058e-01,  5.85508640e-01,  3.08588477e+00,  2.95505014e-01,
       -4.78385848e-01, -4.59161453e-01, -3.48253641e-01, -1.14609224e+00,
        1.82537330e+00,  9.09646044e-01,  4.97846899e-01,  1.62327408e-01,
        1.20483231e+00, -1.08047174e+00, -1.07708298e+00, -5.15594990e-01,
       -1.19458902e+00, -1.47718484e+00, -1.16525341e+00,  1.76603523e+00,
       -6.13894696e-01, -1.73649193e+00, -4.58198845e-02,  1.24054104e+00,
       -1.20484651e+00, -1.15130137e+00, -1.53511564e-01, -8.63660037e-01,
       -3.56885254e-01,  4.08486356e-01,  1.02330030e+00, -1.68575770e+00,
       -7.98132474e-01, -1.74924264e-01, -1.15898405e+00,  5.09340087e-01,
       -2.73519051e+00,  3.85768112e-01, -1.19898927e+00,  1.02833819e+00,
        3.69762059e-01, -1.67025444e-01,  7.09047206e-01,  1.82174386e+00,
       -5.68673198e-01,  1.60734604e+00, -1.53711375e-01,  2.37173508e-01,
        1.03648139e+00, -5.16948400e-01,  7.25286672e-01, -7.14145764e-01,
        7.48037367e-02,  1.52623636e+00, -5.25740674e-01, -1.00496768e+00,
       -2.04186637e+00,  8.83574692e-01, -3.80298890e-01, -2.30477019e-02,
       -1.36322608e-01, -8.94126320e-01, -2.29773254e-02,  9.13174203e-01,
        7.14408740e-01,  3.51838445e-01,  6.00256572e-01,  5.12902235e-02,
        1.35346507e+00, -1.11881733e+00, -1.34866945e+00,  3.39540351e-01,
        1.00424668e+00, -1.74546532e+00, -5.03521991e-01, -2.05081118e+00,
       -1.12392990e+00, -1.69716494e+00, -6.02774126e-01, -1.18906194e+00,
       -3.04961582e-01,  8.75302495e-01, -1.79953693e-01,  1.43894500e+00,
        6.59279149e-01, -1.31511001e+00, -2.87311024e-01,  1.24534793e+00,
       -5.16414426e-01, -1.22308555e-01, -4.21003721e-01,  1.39407898e+00,
        1.79909896e+00, -1.80871112e-01, -3.34128781e+00,  8.55315450e-01,
       -1.27370259e+00, -1.18954146e+00, -1.41977794e-01, -3.25516776e-01,
       -1.78027072e+00, -4.79924612e-01, -1.59727474e+00,  1.46322409e-01,
       -1.37460132e+00, -7.12869192e-01, -5.98287527e-01, -5.40629801e-01,
        9.37408966e-01,  3.22830994e-01,  9.83000902e-01, -1.14115425e+00,
       -9.21647483e-01, -6.78599399e-02,  1.06479446e+00, -8.46157708e-02,
        1.05730140e+00,  8.52297646e-02,  1.51104563e+00,  1.12018958e+00,
       -8.79836388e-01,  8.66463665e-01, -3.28036564e-01, -9.75325484e-01,
        5.45102357e-01,  9.75723076e-02,  3.93767672e-01,  1.52040874e-02,
       -5.42404020e-01,  2.39605662e-01,  1.43769365e+00,  2.06940045e-01,
        3.61637021e-01,  1.81493341e+00, -2.05613603e-01, -1.92172185e-01,
       -6.12061020e-01,  5.20397486e-01, -6.87656532e-01,  1.10453513e+00,
       -4.39107150e-01, -3.69044383e-01,  1.61413100e+00,  2.34029622e-01,
        3.02358620e-01,  4.60993664e-01, -1.86774966e+00, -5.22768669e-02,
       -2.05440323e-01, -2.27521249e-01,  6.78594659e-01,  8.92923896e-01,
        8.55376628e-02, -3.86607530e-01, -1.10514190e+00,  7.62854970e-01,
        6.69235520e-01,  4.28068994e-01, -1.16579561e+00,  4.31272893e-01,
       -1.13877240e-02,  1.07406155e-01,  4.79593697e-01, -3.13390512e-01,
        8.64123102e-01, -2.81066256e-01,  4.68308925e-01, -1.25082300e+00,
       -2.21606127e+00, -1.80676595e+00,  8.74519377e-01, -1.00586629e+00,
       -1.69513449e+00,  9.07924827e-01,  7.73181645e-01, -9.50898128e-01,
        8.48494787e-03,  1.59731318e+00,  1.23573484e+00, -5.29757052e-01,
        8.38511030e-02, -1.10033848e+00,  1.11974280e+00, -6.42432529e-01,
        6.56243299e-01, -1.54844495e-01, -1.70373648e-01,  7.43361592e-02,
       -1.47802368e+00, -1.76449513e+00, -1.45600711e+00,  6.72840954e-01,
        6.04474010e-04, -1.94731910e-01,  1.46315899e-01,  5.53737775e-01,
        7.06798544e-02,  6.10961568e-01,  2.97379572e-01, -1.66196495e+00,
       -2.10057031e+00, -2.34275093e-01,  1.62130044e+00,  2.06204854e+00,
        8.47391968e-01, -9.24703797e-01, -5.06307478e-01, -1.42870371e+00,
       -9.49788671e-01,  1.23007226e-01,  4.57073701e-01,  2.10057432e-01,
       -1.07898149e+00, -1.28636853e+00,  2.28484390e-01, -5.61850785e-01,
        2.66958775e-01,  1.19272524e+00, -6.75582067e-01, -6.84223871e-01,
        1.90194313e+00, -8.95806159e-01, -5.54929134e-01, -7.54655568e-01,
        5.84777888e-01,  5.59968696e-02,  9.40965341e-02,  8.61729212e-01,
       -5.28887140e-01,  7.57865051e-02,  7.98451775e-01, -1.12719249e+00,
        2.55165181e-01, -1.69611488e+00, -6.18277438e-01,  1.07398101e+00,
        1.28801488e+00,  1.79462024e-01, -7.59091097e-01, -5.84499265e-01,
        5.19077942e-01, -8.14594405e-01,  6.36046627e-01,  5.16885246e-01,
       -4.94928681e-01, -5.88694922e-01, -1.28286522e+00,  2.12789750e-01,
       -1.90901274e-01,  1.84438911e-01,  2.30888306e+00, -5.76051431e-01,
        1.61690948e-02,  4.73729360e-01, -1.23004336e+00,  8.71594532e-01,
        7.82155354e-01, -1.34807430e+00,  2.67905138e-01,  2.84661230e-01,
        1.18731186e-01, -1.27438691e+00,  8.14807005e-01, -2.45852712e-01,
        9.16787310e-02, -8.54952213e-01, -7.45769223e-01,  5.50152406e-01,
       -2.25188193e-01, -1.32439188e-01, -1.39151847e+00,  6.89488418e-01,
        9.67359836e-01, -8.78223259e-01,  1.10797809e+00,  1.78327944e-01,
        3.76391986e-01,  8.69086970e-01, -5.71044792e-01,  5.21747781e-01,
        3.72257775e-01, -8.91684122e-01, -1.68112247e+00,  7.39820833e-01,
       -5.61878470e-01, -1.21568227e+00, -8.14870102e-01, -8.64914474e-01,
        1.86949462e-01,  3.09937423e-02, -3.80905880e-01, -3.87366915e-01,
        8.87618985e-01,  1.27824038e+00, -2.00118043e+00, -5.61795924e-01,
       -1.99197405e+00,  1.57044094e-01,  2.70702722e-01, -2.92957728e-01,
       -1.05775334e+00, -1.94671194e+00, -3.77213607e-01, -4.14979829e-01,
       -6.58036309e-01,  7.92607351e-02,  2.88364865e-01,  1.11264771e+00,
       -5.01042941e-01,  5.48609815e-01,  1.28241827e+00,  1.40406978e+00,
        6.08591663e-01, -1.00688436e+00,  8.27724417e-01,  1.74107833e+00,
        4.37032799e-01,  1.53565803e-01, -2.31733907e+00,  2.00565205e-01,
       -1.05274494e+00,  1.02046719e+00,  6.72780848e-01, -1.61800897e+00,
        9.64077798e-01, -1.69707385e+00, -1.03474438e+00, -2.29125095e+00,
       -6.50260751e-01, -2.24472382e-01,  5.18656258e-01, -6.49663468e-01,
        6.24274134e-01,  1.38177062e+00, -2.71247532e-01,  4.53765490e-02,
        8.48758810e-01,  4.34728258e-01,  7.11661656e-01,  4.50795106e-01,
        2.29069464e-01, -8.54853160e-01, -1.13397403e-01, -1.14771585e+00,
        2.01466692e-01,  6.50135161e-01,  1.34165044e+00, -4.86580342e-01,
       -8.36520282e-01,  9.45124895e-01, -9.23727309e-01,  8.70028959e-02,
        1.12010515e-01,  1.80494300e+00, -2.38672925e+00,  3.43378750e-01,
       -3.70984637e-01,  6.96353798e-01,  2.39888847e-01, -6.76081286e-01,
        7.14420540e-01, -2.10770407e+00, -1.50199907e+00, -5.98721923e-01,
       -7.71814033e-01,  1.77139270e-01,  9.85705787e-01,  5.19588013e-01,
        1.83757030e-02,  8.27846790e-01, -1.95554531e-01,  1.15418666e-01,
        1.08879573e+00, -2.48173262e+00,  2.88737269e-01, -2.78248939e-01,
        7.65673500e-01, -2.76561605e+00, -1.07500872e+00,  2.18570547e-01,
       -1.39896778e+00, -6.04588712e-01,  5.49079241e-01,  1.15813116e+00,
       -1.54821114e+00,  1.61937105e+00,  2.77004331e-01,  6.48372628e-02,
        6.25939164e-01, -8.36022646e-01, -1.41156923e+00, -1.85841197e+00,
        1.06063251e-01,  4.79761561e-01,  6.19123920e-01, -6.52894551e-01,
        3.58603595e-01, -3.87552810e-01, -2.28247929e-01,  4.37615236e-01,
        3.60595535e-01, -1.88004252e-01, -4.24979203e-01,  1.94368532e-01,
        6.88495799e-01,  2.49047689e-01,  1.07406289e-01,  2.70637024e-01,
       -8.85937764e-01, -1.82032607e+00,  1.67201366e+00, -7.76254607e-01,
        3.08239734e-01,  5.49880969e-02, -1.79764646e+00, -1.14656073e+00,
       -1.35484019e+00,  1.89909115e+00,  6.81562970e-02,  9.66559353e-01,
        6.37394009e-01,  3.75480075e-01,  6.33033684e-01,  1.51394667e+00,
        1.32721500e-01, -1.37576134e+00,  8.78796303e-01,  9.51608373e-01,
       -1.82113919e+00, -9.22046848e-01, -1.56313066e+00, -1.20694243e+00,
        8.50402671e-01,  5.91756754e-01, -1.34449724e-01, -7.04122932e-02,
       -4.71851376e-01,  4.36528421e-03,  2.83695283e-01, -2.98453634e-01,
       -2.70441408e-01, -1.03887585e+00,  3.66199962e-01, -2.73305248e-01,
        9.89657898e-01, -8.22282944e-01,  6.97591345e-01,  1.61870885e-01,
       -7.53932364e-01,  1.87200573e-02, -5.92027745e-01,  1.77587430e-01,
       -4.34318302e-01, -6.28436130e-01,  7.38889448e-01,  3.85058537e-01,
        9.38130775e-01,  1.70602432e+00, -1.12601501e+00, -6.56061901e-01,
       -1.83325139e+00,  4.63951822e-01,  5.07829016e-01,  9.42620915e-01,
        3.67169620e-01, -3.05577906e-01,  5.99921566e-01, -2.12795953e+00,
        1.91933079e+00, -2.11262545e-01, -6.07360987e-01,  3.83426496e-02,
       -6.44264250e-01,  5.56518161e-02,  1.00025005e+00,  1.04404286e+00,
        4.13492831e-01,  1.97198809e+00, -1.60127878e+00,  2.81924870e-01,
        3.91597487e-01,  1.86481047e+00, -1.54804716e+00, -1.18850775e+00,
        2.20654639e+00, -4.32574048e-01, -2.03183297e+00,  8.02220447e-01,
        2.07102720e-01,  7.89558562e-01, -1.34500229e+00, -7.33607643e-01,
       -1.52088283e-01,  8.76197729e-01, -1.80451291e-01, -1.60103062e+00,
        1.18345725e+00,  1.16205011e-01, -9.74473713e-02,  3.45764935e-02,
       -9.66754635e-01,  1.13359018e+00, -2.45109172e-01,  2.62208761e-01,
       -6.33912805e-01, -1.81747915e+00, -7.94188155e-01,  7.69326426e-01,
       -3.71932031e-01,  2.31770139e+00, -2.62763769e-01,  1.59274079e+00,
       -2.68439836e-03,  4.80211925e-01, -1.89166585e+00,  9.26834266e-01,
        1.94319319e-01,  7.43469682e-01,  2.86344300e+00, -1.40163795e-01,
        3.95822358e-01, -1.54955409e-01, -8.57673332e-01, -4.75012119e-01,
        6.17040390e-01,  1.40851300e-01,  1.89422396e+00, -7.32016031e-01,
        2.16988962e-01,  3.95835192e-01,  1.26748301e+00, -7.98603131e-01,
        1.15127125e+00, -1.79884946e+00,  9.70963335e-01, -5.67316435e-01,
       -1.53892909e+00,  7.69683553e-01, -1.77860056e+00, -7.57772202e-01,
       -1.61849199e-02,  8.66191084e-01,  6.29421849e-01, -6.52808553e-01,
       -2.43018240e+00, -2.32726763e-01,  3.80919773e-01,  1.99377775e+00,
        1.74355798e-01, -7.69756729e-02, -1.81588013e-01,  1.06438550e+00,
       -2.22361995e+00,  6.99820763e-02,  1.27456623e+00,  1.92351734e-02,
        1.41304546e-01,  6.43803220e-01, -7.67490471e-01,  4.36509065e-01,
       -1.22472070e+00,  1.20319247e+00, -8.02537520e-01, -1.83189158e+00,
       -1.08780765e+00, -1.23364838e-02, -3.38843460e-02, -1.08198216e+00,
       -8.33355828e-01,  1.92510836e-01,  1.43257057e+00,  4.42331872e-01,
        4.24548924e-01, -8.25760098e-01, -6.22547641e-02, -9.85603753e-01,
        1.41383573e+00, -8.96559837e-03,  8.34973654e-01,  4.43502725e-01,
       -4.03430908e-01,  6.94280052e-01,  1.48816024e+00,  1.52637692e+00,
       -6.39413179e-01,  2.58407394e-01,  1.03606338e+00,  7.18467729e-01,
        4.87232402e-01,  7.20624369e-01, -7.16575043e-02,  2.77024965e-01,
        1.49879645e+00,  7.04635564e-01,  4.61343326e-01,  2.97163662e-01,
       -5.11290559e-01, -3.30797543e-01,  1.14468562e+00, -6.80630036e-01,
        3.36343206e-01,  1.55546583e+00,  7.79747598e-02,  1.39732358e+00,
       -1.59106154e-01, -1.96047169e-01, -1.48150594e+00, -4.53640583e-01,
       -2.22235414e-01, -1.17090495e+00,  2.19429150e+00, -9.55286995e-01,
       -6.54132578e-01, -8.30108189e-01, -2.59325946e-01,  7.30876973e-01,
        2.14800173e-01, -2.28288154e-02,  1.53220008e-01,  1.68319997e+00,
        1.30934107e+00,  9.48058563e-01,  7.93593951e-01, -6.14707329e-02,
       -1.05477799e+00,  1.19727352e+00,  4.50325930e-01, -6.88056184e-02,
       -1.94415030e+00, -2.37943159e-01,  1.79077684e+00, -1.11473829e+00,
        1.93732945e+00, -3.36752573e-03,  2.12285845e-01,  4.45754600e-01,
        2.01633229e-01, -1.84723206e+00,  1.05289726e+00, -1.68027899e-01,
       -7.06828753e-01,  1.29574924e+00,  1.81932041e+00, -1.61445110e+00,
        1.15503700e+00, -1.68710531e+00,  5.24199501e-03,  5.39848464e-01,
       -4.04726594e-01,  1.16707191e+00,  9.79445050e-01, -1.22580848e+00,
       -2.30062535e-01,  1.00383029e+00, -7.34646677e-01, -8.26878016e-01])

In [106]:
cats = pd.qcut(data, 4)

In [107]:
cats

[(0.0553, 0.689], (-0.65, 0.0553], (0.0553, 0.689], (0.0553, 0.689], (0.0553, 0.689], ..., (-3.342, -0.65], (-0.65, 0.0553], (0.689, 3.667], (-3.342, -0.65], (-3.342, -0.65]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.342, -0.65] < (-0.65, 0.0553] < (0.0553, 0.689] < (0.689, 3.667]]

In [108]:
pd.value_counts(cats)

(-3.342, -0.65]    250
(-0.65, 0.0553]    250
(0.0553, 0.689]    250
(0.689, 3.667]     250
dtype: int64

In [109]:
cats = pd.cut(data, 4, precision=2)

In [110]:
pd.value_counts(cats) # 不是均匀分布的个数

(-1.59, 0.16]     484
(0.16, 1.91]      426
(-3.35, -1.59]     72
(1.91, 3.67]       18
dtype: int64

In [111]:
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.0])

In [112]:
cats

[(0.0553, 1.268], (-1.283, 0.0553], (0.0553, 1.268], (0.0553, 1.268], (0.0553, 1.268], ..., (-1.283, 0.0553], (-1.283, 0.0553], (0.0553, 1.268], (-1.283, 0.0553], (-1.283, 0.0553]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.342, -1.283] < (-1.283, 0.0553] < (0.0553, 1.268] < (1.268, 3.667]]

In [113]:
pd.value_counts(cats)

(-1.283, 0.0553]    400
(0.0553, 1.268]     400
(-3.342, -1.283]    100
(1.268, 3.667]      100
dtype: int64